
<table>
<tr>
<td width=15%><img src="./img/UGA.png"></img></td>
<td><center><h1>Introduction to Python for Data Sciences</h1></center></td>
<td width=15%><a href="http://www.iutzeler.org" style="font-size: 16px; font-weight: bold">Franck Iutzeler</a> </td>
</tr>
</table>


<br/><br/>

<center><a style="font-size: 40pt; font-weight: bold">Chap. 3 - Data Handling with Pandas </a></center> 

<br/><br/>



# 2- Dataframes

## Operations

In [53]:
import numpy as np
import pandas as pd

### Numpy operations


If we apply a NumPy function on a Pandas datframe, the result will be another Pandas dataframe with the indices preserved.

In [54]:
df = pd.DataFrame(np.random.randint(0, 10, (3, 4)), columns=['A', 'B', 'C', 'D'])
df

   A  B  C  D
0  8  5  6  2
1  7  6  4  1
2  1  8  9  6

In [55]:
np.cos(df * np.pi/2 ) - 1

     A    B    C    D
0  0.0 -1.0 -2.0 -2.0
1 -1.0 -2.0  0.0 -1.0
2 -1.0  0.0 -1.0 -2.0

### Arithmetic operations

Arithmetic operations can also be performed either with <tt>+ - / *</tt> or with dedicated <tt>add multiply</tt> etc methods

In [56]:
A = pd.DataFrame(np.random.randint(0, 20, (4, 2)), columns=list('AB'))
A

   A   B
0  1   2
1  3  19
2  1   1
3  4   2

In [57]:
B = pd.DataFrame(np.random.randint(0, 10, (3, 3)), columns=list('BAC'))
B

   B  A  C
0  6  8  1
1  1  3  8
2  5  5  9

In [58]:
A+B

     A     B   C
0  9.0   8.0 NaN
1  6.0  20.0 NaN
2  6.0   6.0 NaN
3  NaN   NaN NaN

The pandas arithmetic functions also have an option to fill missing values by replacing the missing one in either of the dataframes by some value.

In [59]:
A.add(B, fill_value=0.0)

     A     B    C
0  9.0   8.0  1.0
1  6.0  20.0  8.0
2  6.0   6.0  9.0
3  4.0   2.0  NaN

## Concatenating, and Merging

Thanks to naming, dataframes can be easily added, merged, etc. However, if some entries are missing (columns or indices), the operations may get complicated. Here the most standard situations are covered, take a look at the documentation (notably [this one on merging, appending, and concatenating](https://pandas.pydata.org/pandas-docs/stable/merging.html) )

* **Concatenating** is for adding lines and/or columns of multiples datasets (it is a generalization of appending)

In [60]:
A = pd.DataFrame(np.random.randint(0, 20, (2, 2)), columns=list('AB'))
A2 = pd.DataFrame(np.random.randint(0, 20, (3, 2)), columns=list('AB'))
A3 = pd.DataFrame(np.random.randint(0, 20, (2, 3)), columns=list('CAD'))
print("A:\n",A,"\nA2:\n",A2,"\nA3:\n",A3)

A:
     A   B
0   3  10
1  18   7
A2:
    A  B
0  8  7
1  3  7
2  2  0
A3:
    C   A   D
0  4  16  16
1  0  15   3

The most important settings of the <tt>concat</tt> function are <tt>pd.concat(objs, axis=0, join='outer',ignore_index=False)</tt> where <br/>
. *objs* is the list of dataframes to concatenate <br/>
. *axis* is the axis on which to concatenate 0 (default) for the lines and 1 for the columns <br/>
. *join* is to decide if we keep all columns/indices on the other axis ('outer' ,default), or the intersection ( 'inner') <br/>
. *ignore_index* is to decide is we keep the previous names (False, default) or give new ones (True)


For a detailed view see  [this doc on merging, appending, and concatenating](https://pandas.pydata.org/pandas-docs/stable/merging.html)

In [61]:
pd.concat([A,A2,A3],ignore_index=True)

    A     B    C     D
0   3  10.0  NaN   NaN
1  18   7.0  NaN   NaN
2   8   7.0  NaN   NaN
3   3   7.0  NaN   NaN
4   2   0.0  NaN   NaN
5  16   NaN  4.0  16.0
6  15   NaN  0.0   3.0

In [62]:
pd.concat([A,A2,A3],axis=1)

      A     B  A  B    C     A     D
0   3.0  10.0  8  7  4.0  16.0  16.0
1  18.0   7.0  3  7  0.0  15.0   3.0
2   NaN   NaN  2  0  NaN   NaN   NaN

In [63]:
pd.concat([A,A2,A3],axis=1,ignore_index=True,join='inner')

    0   1  2  3  4   5   6
0   3  10  8  7  4  16  16
1  18   7  3  7  0  15   3

* **Merging** is for putting together two dataframes with *hopefully* common data


For a detailed view see  [this doc on merging, appending, and concatenating](https://pandas.pydata.org/pandas-docs/stable/merging.html)

In [64]:
df1 = pd.DataFrame({'employee': ['Bob', 'Jake', 'Lisa', 'Sue'],
                    'group': ['Accounting', 'Engineering', 'Engineering', 'HR'],
                    'company': ['Google', 'Apple', 'Apple', 'Google']})
df1

  employee        group company
0      Bob   Accounting  Google
1     Jake  Engineering   Apple
2     Lisa  Engineering   Apple
3      Sue           HR  Google

In [65]:
df2 = pd.DataFrame({'employee': ['Lisa', 'Bob', 'Jake', 'Sue'],
                    'hire_date': [2004, 2008, 2012, 2014]})
df2

  employee  hire_date
0     Lisa       2004
1      Bob       2008
2     Jake       2012
3      Sue       2014

In [66]:
df3 = pd.merge(df1,df2)
df3

  employee        group company  hire_date
0      Bob   Accounting  Google       2008
1     Jake  Engineering   Apple       2012
2     Lisa  Engineering   Apple       2004
3      Sue           HR  Google       2014

In [67]:
df4 = pd.DataFrame({'group': ['Accounting', 'Engineering', 'HR'],
                    'supervisor': ['Carly', 'Guido', 'Steve'],
                    'company': ['Google', 'Meta', 'Google']})
df4

         group supervisor company
0   Accounting      Carly  Google
1  Engineering      Guido    Meta
2           HR      Steve  Google

In [68]:
pd.merge(df3,df4)

  employee       group company  hire_date supervisor
0      Bob  Accounting  Google       2008      Carly
1      Sue          HR  Google       2014      Steve

##  Preparing the Data


Before exploring the data, it is primordial to verify its soundness, indeed if it has missing or replicated data, the results of our test may not be accurate. Pandas provides a collection of methodes to verify the sanity of the data (recall that when data is missing for an entry, it is noted as `NaN`, and thus any further operation including this will be `NaN`). 


To explore some typical problems in a dataset, I messed with a small part of the [*MovieLens*](https://grouplens.org/datasets/movielens/) dataset. The `ratings_mess.csv` file contains 4 columns:
* `userId` id of the user, integer greater than 1 
* `movieId`  id of the user, integer greater than 1 
* `rating` rating of the user to the movie, float between 0.0 and 5.0  
* `timestamp` timestamp, integer 

and features (man-made!) errors, some of them minor some of them major.

In [69]:
ratings = pd.read_csv('data/ml-small/ratings_mess.csv')
ratings.head(7) # enables to display the top n lines of a dataframe, 5 by default

   userId  movieId  rating     timestamp
0     1.0     31.0     2.5  1.260759e+09
1     1.0   1029.0     3.0  1.260759e+09
2     2.0     10.0     4.0           NaN
3     2.0     52.0    83.0  8.353560e+08
4     NaN     62.0     3.0  8.353557e+08
5     2.0    144.0     NaN  8.353560e+08
6     0.0    616.0     3.0  8.353559e+08

### Missing values


Pandas provides functions that check if the values are missing:

* ``isnull()``: Generate a boolean mask indicating missing values
* ``notnull()``: Opposite of ``isnull()``

In [70]:
ratings.isnull().head(5)

   userId  movieId  rating  timestamp
0   False    False   False      False
1   False    False   False      False
2   False    False   False       True
3   False    False   False      False
4    True    False   False      False

### Carefully pruning data

Now that we have to prune lines of our data, this will be done using `dropna()` through `dataframe.dropna(subset=["col_1","col_2"],inplace=True)` which drops all rows with at least one missing value in the columns `col1, col2` of `dataframe` *in place* that is *without copy*.


**Warning:** this function deletes any line with at least **one** missing data, which is not always wishable. Also, with *inplace=True*, it is applied in place, meaning that they modify the dataframe it is applied to, it is thus an **irreversible operation**; drop `inplace=True` to create a copy or see the result before apllying it.

For instance here, `userId,movieId,rating` are essential whereas the `timestamp` is not (it can be dropped for the prediciton process). Thus, we will delete the lines where one of `userId,movieId,rating` is missing and fill the `timestamp` with 0 when it is missing.

In [71]:
ratings.dropna(subset=["userId","movieId","rating"],inplace=True)
ratings
# ratings.head(5)

    userId  movieId  rating     timestamp
0      1.0     31.0     2.5  1.260759e+09
1      1.0   1029.0     3.0  1.260759e+09
2      2.0     10.0     4.0           NaN
3      2.0     52.0    83.0  8.353560e+08
6      0.0    616.0     3.0  8.353559e+08
8      2.0    720.0     4.0  8.353560e+08
9      3.0     60.0     3.0  1.298862e+09
10     3.0    110.0     4.0  1.298922e+09
11     3.0    247.0     3.5  1.298862e+09
13     3.0    592.0     3.0  1.298923e+09
14     3.0    593.0     3.0  1.298922e+09
15     3.0    595.0     2.0  1.298923e+09
16     3.0      0.0     3.0  1.298924e+09
17     3.0   2762.0     3.5  1.298922e+09
18     3.0   2841.0     4.0  1.298862e+09
19     3.0   2858.0    -4.0  1.298922e+09
20     3.0   2959.0     5.0  1.298863e+09
21     4.0     34.0     5.0  9.499196e+08
22     4.0    112.0     5.0  9.498106e+08
23     4.0   1028.0     5.0  9.499496e+08
24     4.0   1030.0     5.0  9.498964e+08
25     4.0   1079.0     5.0           NaN
26     4.0   1089.0     5.0  9.498957e+08
27     4.0   1097.0     5.0  9.497788e+08
28     4.0     -1.0     2.0  9.499822e+08
29     5.0   3176.0   123.5  1.163374e+09
31     5.0   4447.0     4.5  1.163375e+09
32     5.0   4718.0     3.5  1.163375e+09
33     5.0  30749.0     4.5  1.163375e+09
34     6.0    111.0     6.0  1.109258e+09
35     6.0   1250.0     4.5  1.108134e+09

To fill missing data (from a certain column), the recommended way is to use `fillna()` through `dataframe["col"].fillna(value,inplace=True)` which replace all missing values in the column `col` of `dataframe` by `value` *in place* that is without copy (again this is irreversible, to use the copy version use `inplace=False`).

In [72]:
ratings["timestamp"].fillna(0,inplace=True)
ratings.head(7)

/tmp/ipykernel_178222/2486846250.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  ratings["timestamp"].fillna(0,inplace=True)

   userId  movieId  rating     timestamp
0     1.0     31.0     2.5  1.260759e+09
1     1.0   1029.0     3.0  1.260759e+09
2     2.0     10.0     4.0  0.000000e+00
3     2.0     52.0    83.0  8.353560e+08
6     0.0    616.0     3.0  8.353559e+08
8     2.0    720.0     4.0  8.353560e+08
9     3.0     60.0     3.0  1.298862e+09

This indeed gives the correct result, however, the line indexing presents missing number. The indexes can be resetted with  `reset_index(inplace=True,drop=True)`

In [73]:
ratings.reset_index(inplace=True,drop=True)
ratings.head(7)

   userId  movieId  rating     timestamp
0     1.0     31.0     2.5  1.260759e+09
1     1.0   1029.0     3.0  1.260759e+09
2     2.0     10.0     4.0  0.000000e+00
3     2.0     52.0    83.0  8.353560e+08
4     0.0    616.0     3.0  8.353559e+08
5     2.0    720.0     4.0  8.353560e+08
6     3.0     60.0     3.0  1.298862e+09

### Improper values

Even without the missing values, some lines are problematic as they feature values outside of prescribed range (`userId` id of the user, integer greater than 1; `movieId`  id of the user, integer greater than 1; `rating` rating of the user to the movie, float between 0.0 and 5.0; `imestamp` timestamp, integer )

In [74]:
ratings[ratings["userId"]<1]  # Identifying a problem

   userId  movieId  rating    timestamp
4     0.0    616.0     3.0  835355932.0

Now, we drop the corresponding line, with `drop` by `drop(problematic_row.index, inplace=True)`. 

**Warning:** Do not forget `.index` and `inplace=True`

In [75]:
ratings.drop(ratings[ratings["userId"]<1].index, inplace=True)
ratings.head(7)

   userId  movieId  rating     timestamp
0     1.0     31.0     2.5  1.260759e+09
1     1.0   1029.0     3.0  1.260759e+09
2     2.0     10.0     4.0  0.000000e+00
3     2.0     52.0    83.0  8.353560e+08
5     2.0    720.0     4.0  8.353560e+08
6     3.0     60.0     3.0  1.298862e+09
7     3.0    110.0     4.0  1.298922e+09

In [76]:
pb_rows = ratings[ratings["movieId"]<1]
pb_rows

    userId  movieId  rating     timestamp
12     3.0      0.0     3.0  1.298924e+09
24     4.0     -1.0     2.0  9.499822e+08

In [77]:
ratings.drop(pb_rows.index, inplace=True)

And finally the ratings.

In [78]:
pb_rows = ratings[ratings["rating"]<0]
pb_rows2 = ratings[ratings["rating"]>5]
tot_pb_rows = pd.concat([pb_rows, pb_rows2], axis = 0)
tot_pb_rows

    userId  movieId  rating     timestamp
15     3.0   2858.0    -4.0  1.298922e+09
3      2.0     52.0    83.0  8.353560e+08
25     5.0   3176.0   123.5  1.163374e+09
29     6.0    111.0     6.0  1.109258e+09

In [79]:
ratings.drop(tot_pb_rows.index, inplace=True)
ratings.reset_index(inplace=True,drop=True)

We finally have our dataset cured! Let us save it for further use.

`to_csv` saves as CSV into some file, `index=False` drops the index names as we did not specify it.

In [80]:
ratings.to_csv("data/ml-small/ratings_cured.csv",index=False)

##  Basic Statistics 

With our cured dataset, we can begin exploring.

In [81]:
ratings = pd.read_csv('data/ml-small/ratings_cured.csv')
ratings.head()

   userId  movieId  rating     timestamp
0     1.0     31.0     2.5  1.260759e+09
1     1.0   1029.0     3.0  1.260759e+09
2     2.0     10.0     4.0  0.000000e+00
3     2.0    720.0     4.0  8.353560e+08
4     3.0     60.0     3.0  1.298862e+09

The following table summarizes some other built-in Pandas aggregations:

| Aggregation              | Description                     |
|--------------------------|---------------------------------|
| ``count()``              | Total number of items           |
| ``first()``, ``last()``  | First and last item             |
| ``mean()``, ``median()`` | Mean and median                 |
| ``min()``, ``max()``     | Minimum and maximum             |
| ``std()``, ``var()``     | Standard deviation and variance |
| ``mad()``                | Mean absolute deviation         |
| ``prod()``               | Product of all items            |
| ``sum()``                | Sum of all items                |

These are all methods of ``DataFrame`` and ``Series`` objects, and ``description`` also provides a quick overview.

In [82]:
ratings.describe()

          userId       movieId     rating     timestamp
count  24.000000     24.000000  24.000000  2.400000e+01
mean    3.416667   2465.916667   4.020833  1.056019e+09
std     1.212854   6171.507686   0.926414  3.610777e+08
min     1.000000     10.000000   2.000000  0.000000e+00
25%     3.000000    213.250000   3.375000  9.498962e+08
50%     3.000000   1028.500000   4.000000  1.163375e+09
75%     4.000000   1628.000000   5.000000  1.298862e+09
max     6.000000  30749.000000   5.000000  1.298923e+09

We see that these statistics do not make sense for all rows. Let us drop the timestamp and examine the ratings.

In [83]:
ratings.drop("timestamp",axis=1,inplace=True)
ratings.head()

   userId  movieId  rating
0     1.0     31.0     2.5
1     1.0   1029.0     3.0
2     2.0     10.0     4.0
3     2.0    720.0     4.0
4     3.0     60.0     3.0

In [84]:
ratings["rating"].describe()

count    24.000000
mean      4.020833
std       0.926414
min       2.000000
25%       3.375000
50%       4.000000
75%       5.000000
max       5.000000
Name: rating, dtype: float64

## GroupBy 
These ratings are linked to users and movies, in order to have a separate view per user/movie, *grouping* has to be used.

The ``GroupBy`` operation (that comes from SQL) accomplishes:

- The *split* step involves breaking up and grouping a ``DataFrame`` depending on the value of the specified key.
- The *apply* step involves computing some function, usually an sum, median, means etc *within the individual groups*.
- The *combine* step merges the results of these operations into an output array.

<img src="img/GroupBy.png">
<p style="text-align: right">Source: [Python Data Science Handbook](http://shop.oreilly.com/product/0636920034919.do) by Jake VanderPlas</p>

In [85]:
ratings.head()

   userId  movieId  rating
0     1.0     31.0     2.5
1     1.0   1029.0     3.0
2     2.0     10.0     4.0
3     2.0    720.0     4.0
4     3.0     60.0     3.0

So to get the mean of the ratings per user, the command is

In [86]:
ratings.groupby("userId")["rating"].mean()

userId
1.0    2.750000
2.0    4.000000
3.0    3.444444
4.0    5.000000
5.0    4.166667
6.0    4.500000
Name: rating, dtype: float64

### Filtering

Filtering is the action of deleting rows depending on a boolean function. For instance, the following removes the user with a rating of only one movie.

In [87]:
ratings.groupby("userId")["rating"].count()

userId
1.0    2
2.0    2
3.0    9
4.0    7
5.0    3
6.0    1
Name: rating, dtype: int64

In [88]:
def filter_func(x):
    return x["rating"].count() >= 2

filtered = ratings.groupby("userId").filter(filter_func)
filtered

    userId  movieId  rating
0      1.0     31.0     2.5
1      1.0   1029.0     3.0
2      2.0     10.0     4.0
3      2.0    720.0     4.0
4      3.0     60.0     3.0
5      3.0    110.0     4.0
6      3.0    247.0     3.5
7      3.0    592.0     3.0
8      3.0    593.0     3.0
9      3.0    595.0     2.0
10     3.0   2762.0     3.5
11     3.0   2841.0     4.0
12     3.0   2959.0     5.0
13     4.0     34.0     5.0
14     4.0    112.0     5.0
15     4.0   1028.0     5.0
16     4.0   1030.0     5.0
17     4.0   1079.0     5.0
18     4.0   1089.0     5.0
19     4.0   1097.0     5.0
20     5.0   4447.0     4.5
21     5.0   4718.0     3.5
22     5.0  30749.0     4.5

In [89]:
filtered.groupby("userId")["rating"].count()

userId
1.0    2
2.0    2
3.0    9
4.0    7
5.0    3
Name: rating, dtype: int64

### Transformations

Transforming is the actions of applying a transformation (sic).

For instance, let us normalize the ratings so that they have zero mean for each user.

In [90]:
ratings.groupby("userId")["rating"].mean()

userId
1.0    2.750000
2.0    4.000000
3.0    3.444444
4.0    5.000000
5.0    4.166667
6.0    4.500000
Name: rating, dtype: float64

In [91]:
def center_ratings(x):
    x["rating"] = x["rating"] - x["rating"].mean()
    return x

centered = ratings.groupby("userId").apply(center_ratings)
centered

/tmp/ipykernel_178222/2866101309.py:5: DeprecationWarning: DataFrameGroupBy.apply operated on the grouping columns. This behavior is deprecated, and in a future version of pandas the grouping columns will be excluded from the operation. Either pass `include_groups=False` to exclude the groupings or explicitly select the grouping columns after groupby to silence this warning.
  centered = ratings.groupby("userId").apply(center_ratings)

           userId  movieId    rating
userId
1.0    0      1.0     31.0 -0.250000
       1      1.0   1029.0  0.250000
2.0    2      2.0     10.0  0.000000
       3      2.0    720.0  0.000000
3.0    4      3.0     60.0 -0.444444
       5      3.0    110.0  0.555556
       6      3.0    247.0  0.055556
       7      3.0    592.0 -0.444444
       8      3.0    593.0 -0.444444
       9      3.0    595.0 -1.444444
       10     3.0   2762.0  0.055556
       11     3.0   2841.0  0.555556
       12     3.0   2959.0  1.555556
4.0    13     4.0     34.0  0.000000
       14     4.0    112.0  0.000000
       15     4.0   1028.0  0.000000
       16     4.0   1030.0  0.000000
       17     4.0   1079.0  0.000000
       18     4.0   1089.0  0.000000
       19     4.0   1097.0  0.000000
5.0    20     5.0   4447.0  0.333333
       21     5.0   4718.0 -0.666667
       22     5.0  30749.0  0.333333
6.0    23     6.0   1250.0  0.000000

In [97]:
centered.reset_index(drop=True, inplace=True)
centered.groupby("userId")["rating"].mean()

userId
1.0    0.000000e+00
2.0    0.000000e+00
3.0   -1.973730e-16
4.0    0.000000e+00
5.0   -2.960595e-16
6.0    0.000000e+00
Name: rating, dtype: float64

### Aggregations [*]

Aggregations let you aggreagate several operations.

In [44]:
ratings.groupby("userId")["rating"].aggregate([min,max,np.mean,np.median,len])

        min  max      mean  median  len
userId
1.0     2.5  3.0  2.750000    2.75  2.0
2.0     4.0  4.0  4.000000    4.00  2.0
3.0     2.0  5.0  3.444444    3.50  9.0
4.0     5.0  5.0  5.000000    5.00  7.0
5.0     3.5  4.5  4.166667    4.50  3.0
6.0     4.5  4.5  4.500000    4.50  1.0

## Exercises

> **Exercise:** Bots Discovery
>
> In the dataset `ratings_bots.csv`, some users may be bots. To help a movie sucess they add ratings (favorable ones often). To get a better recommendation, we try to remove them.
>
> * Count the users with a mean rating above 4.7/5 and delete them 
>
>   *hint:* the [nunique](https://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.nunique.html)  function may be helpful to count
>
>
> * Delete multiples reviews of a movie by a single user by replacing them with only the first one. What is the proportion of potential bots among the users?
>
>   *hint:* the `groupby` function can be applied to several columns, also `reset_index(drop=True)` removes the grouby indexing. 
>
>  *hint:* remember the `loc` function, e.g.  `df.loc[df['userId'] == 128]` returns a dataframe of the rows where the userId is 128; and `df.loc[df['userId'] == 128].loc[samerev['movieId'] == 3825]` returns a dataframe of the rows where the userId is 128 **and** the movieID is 3825.
>
>  In total , 17 ratings have to be removed. For instance, user 128 has 3 ratings of the movie 3825
>
> This dataset has around 100 000 ratings so hand picking won't do!

In [143]:
import pandas as pd
import numpy as np

ratings_bots = pd.read_csv('data/ml-small/ratings_bots.csv')

In [151]:
def idem(x):
    return x

intermediate = ratings_bots.groupby("userId")["rating"].mean() 
intermediate.reset_index(drop=True)
print(intermediate.sort_values(ascending=True))
value = intermediate.values
print(np.sort(value))
# human_list = intermediate[intermediate <= 4.75]
# human_list = pd.DataFrame({"userId": list(human_list.index)})
# true_ratings = pd.merge(ratings_bots, human_list)
# print(len(ratings_bots) - len(true_ratings))
# print(true_ratings.groupby("userId").mean())

userId
579    1.333333
581    1.459184
207    1.804348
609    1.985714
429    2.240741
         ...
622    4.725806
448    4.750000
298    4.800000
443    4.850000
46     4.948718
Name: rating, Length: 671, dtype: float64
[1.33333333 1.45918367 1.80434783 1.98571429 2.24074074 2.36797753
 2.4        2.45454545 2.50280505 2.51818182 2.525      2.55
 2.55769231 2.5950096  2.61316568 2.62176471 2.63636364 2.64197531
 2.66043956 2.675      2.68181818 2.70454545 2.70491803 2.71052632
 2.72058824 2.72413793 2.75409836 2.76183206 2.775      2.7826087
 2.78536585 2.825      2.83908046 2.84702259 2.85       2.85
 2.85714286 2.859375   2.86363636 2.8677686  2.875      2.88095238
 2.88636364 2.89423631 2.90410959 2.93554688 2.94845361 2.95
 2.95       2.95       2.95238095 2.953125   2.95639535 2.95744681
 2.96591789 2.97674419 2.97727273 2.98192771 3.         3.
 3.0063788  3.015625   3.01587302 3.02298851 3.03448276 3.04
 3.05034325 3.06521739 3.07142857 3.07307692 3.08333333 3.08333333
 3.09076433 3.09090909 3.10344828 3.10901826 3.11380145 3.11538462
 3.12       3.125      3.125      3.1372549  3.14690722 3.15277778
 3.15447154 3.16071429 3.16350711 3.166      3.16666667 3.17333333
 3.17407407 3.18314425 3.18518519 3.18691589 3.1891791  3.19135802
 3.19135802 3.19230769 3.19298246 3.19444444 3.20560748 3.2173913
 3.22580645 3.22727273 3.23298969 3.23333333 3.23529412 3.23728814
 3.23809524 3.2434555  3.24703557 3.24822695 3.24836601 3.2484472
 3.25       3.25       3.25       3.25438596 3.25862069 3.26136364
 3.2721519  3.27272727 3.27277657 3.27409639 3.275      3.27536232
 3.27586207 3.27931034 3.2826087  3.2826087  3.28571429 3.28571429
 3.28947368 3.29032258 3.29066667 3.29081633 3.3        3.3028169
 3.31034483 3.31904762 3.32692308 3.33661417 3.34285714 3.34792627
 3.34969325 3.35135135 3.35817805 3.359375   3.36       3.36
 3.3627451  3.36285714 3.3664158  3.36673889 3.36679214 3.37096774
 3.37337662 3.3742236  3.37681159 3.37843137 3.38181818 3.38732394
 3.39090909 3.39361702 3.39393939 3.39413681 3.39488117 3.39583333
 3.39655172 3.39705882 3.3976378  3.4        3.4        3.4
 3.4        3.4        3.40030675 3.40217391 3.40561224 3.40620155
 3.41019417 3.41025641 3.4109589  3.41176471 3.4122807  3.41304348
 3.41304348 3.41935484 3.42431193 3.43085106 3.43548387 3.43589744
 3.44117647 3.44984802 3.45       3.4516129  3.45833333 3.46308725
 3.46315789 3.46464646 3.46590909 3.46802326 3.46835443 3.47058824
 3.47368421 3.475      3.47619048 3.47727273 3.47727273 3.48
 3.48148148 3.4822695  3.48314607 3.48550725 3.48684211 3.49494949
 3.5        3.5        3.5        3.5        3.50078003 3.50617284
 3.50793651 3.50819672 3.50847458 3.50909091 3.51111111 3.51162791
 3.51169591 3.51173021 3.51219512 3.51461988 3.51538462 3.51578947
 3.51818182 3.52173913 3.52564103 3.52631579 3.52649007 3.52980132
 3.53191489 3.53427896 3.53571429 3.54545455 3.54761905 3.55246253
 3.55251142 3.55363322 3.55479452 3.56       3.56097561 3.56666667
 3.56756757 3.56756757 3.56862745 3.56976744 3.57142857 3.572843
 3.57983193 3.58       3.58       3.58333333 3.58333333 3.5844773
 3.58518519 3.5862069  3.58888889 3.58974359 3.59459459 3.59473684
 3.59797297 3.6        3.6        3.6        3.6025974  3.60465116
 3.60526316 3.60679612 3.60784314 3.60869565 3.609375   3.61029412
 3.61231884 3.61363636 3.61494253 3.61525974 3.61538462 3.61538462
 3.61785714 3.61811024 3.61904762 3.625      3.62601626 3.62628337
 3.62681159 3.62890625 3.629683   3.63       3.63157895 3.63276836
 3.63292011 3.63425926 3.63565891 3.63901345 3.64       3.64026403
 3.64150943 3.64150943 3.64285714 3.64414414 3.64482759 3.64646465
 3.64705882 3.6492891  3.65254237 3.65306122 3.65339578 3.65384615
 3.65533981 3.65789474 3.65789474 3.65942029 3.66015625 3.66097561
 3.66216216 3.66666667 3.66666667 3.66666667 3.66666667 3.6677116
 3.67142857 3.67307692 3.67391304 3.67391304 3.675      3.675
 3.675      3.67647059 3.67676768 3.67741935 3.67746914 3.67924528
 3.68309859 3.68333333 3.68627451 3.6875     3.69117647 3.69230769
 3.69565217 3.6969697  3.69736842 3.7        3.7012987  3.7037037
 3.7037037  3.7037037  3.70666667 3.70790378 3.70967742 3.71144279
 3.71341463 3.71478873 3.71551724 3.71794872 3.71794872 3.72489083
 3.72566372 3.72727273 3.72826087 3.73076923 3.73333333 3.734375
 3.7375     3.73795181 3.74       3.74358974 3.74380165 3.744
 3.74528302 3.7453271  3.75       3.75       3.75555556 3.75647668
 3.75694444 3.75728155 3.75757576 3.75773196 3.75882353 3.76315789
 3.76508408 3.76666667 3.76744186 3.76829268 3.76973684 3.7873494
 3.78776978 3.78947368 3.79032258 3.79047619 3.79245283 3.79545455
 3.7962963  3.79672447 3.796875   3.79761905 3.79831933 3.79874214
 3.8        3.8        3.80172414 3.80555556 3.80612245 3.80645161
 3.80681818 3.80745342 3.80769231 3.81333333 3.81679389 3.81818182
 3.81818182 3.81904762 3.82       3.82608696 3.82608696 3.83050847
 3.83333333 3.83333333 3.83333333 3.83333333 3.8358209  3.84444444
 3.8452381  3.85       3.85185185 3.85714286 3.85714286 3.86363636
 3.86363636 3.86363636 3.86461538 3.86637931 3.86683417 3.86725664
 3.86842105 3.86842105 3.87155963 3.875      3.875      3.875
 3.87969925 3.88461538 3.89285714 3.89632107 3.9        3.9
 3.9        3.9        3.9        3.90189873 3.90217391 3.90384615
 3.90789474 3.91       3.91       3.91269841 3.91333333 3.91525424
 3.91666667 3.91666667 3.91896552 3.92307692 3.92631579 3.92857143
 3.93167702 3.9326087  3.93349754 3.93582888 3.93865031 3.94
 3.94285714 3.94491525 3.946875   3.94932432 3.95081967 3.952
 3.95323741 3.95454545 3.95575221 3.9569378  3.95833333 3.95918367
 3.96153846 3.96721311 3.96774194 3.96774194 3.96875    3.97
 3.97492625 3.975      3.97560976 3.97647059 3.98275862 3.98529412
 3.98648649 3.99479167 3.99674267 3.99867725 4.         4.
 4.         4.         4.         4.         4.         4.
 4.         4.         4.00757576 4.00803859 4.01041667 4.01282051
 4.01428571 4.01485149 4.015625   4.01778656 4.01869159 4.02380952
 4.02439024 4.03571429 4.03571429 4.0375     4.03773585 4.04662698
 4.04761905 4.04761905 4.04761905 4.05263158 4.05681818 4.06060606
 4.0625     4.0625     4.06349206 4.06521739 4.06796117 4.0686901
 4.07575758 4.07894737 4.08       4.08       4.08333333 4.08536585
 4.08571429 4.09677419 4.10204082 4.10588235 4.10666667 4.10714286
 4.10869565 4.1097561  4.11061947 4.11111111 4.11111111 4.12068966
 4.12142857 4.125      4.12903226 4.13017751 4.13114754 4.13513514
 4.13580247 4.13761468 4.13815789 4.14       4.14365672 4.14473684
 4.14814815 4.15       4.15634675 4.15671642 4.15686275 4.15833333
 4.16076294 4.16666667 4.16666667 4.16847826 4.17333333 4.175
 4.17647059 4.17808219 4.18181818 4.18181818 4.1875     4.19166667
 4.2        4.20408163 4.20481928 4.21146953 4.21153846 4.2173913
 4.22097378 4.22258065 4.22444444 4.22988506 4.23333333 4.23529412
 4.24074074 4.24242424 4.25       4.25       4.25925926 4.26086957
 4.26388889 4.26451613 4.26666667 4.27272727 4.27333333 4.27560976
 4.28       4.28191489 4.28571429 4.29032258 4.29166667 4.29279279
 4.29292929 4.296875   4.29847909 4.30882353 4.30882353 4.30909091
 4.30978261 4.31081081 4.31578947 4.31666667 4.31818182 4.32352941
 4.33098592 4.33953488 4.34453782 4.34587814 4.34782609 4.34803922
 4.35       4.35185185 4.375      4.38414634 4.3880597  4.4
 4.403125   4.40909091 4.41129032 4.41538462 4.41666667 4.41860465
 4.4529703  4.46616541 4.47201493 4.47340426 4.5        4.5
 4.51162791 4.5234375  4.53149606 4.59090909 4.62       4.62962963
 4.72580645 4.75       4.8        4.85       4.94871795]

> **Exercise:** Planets discovery
> 
> We will use the Planets dataset, available via the [Seaborn package](http://seaborn.pydata.org/). It provides information on how astronomers found new planets around stars, *exoplanets*.
>
> * Display median, mean and quantile informations for these planets orbital periods, masses, and distances.
> * For each method, display statistic on the years planets were discovered using this technique.

In [100]:
import pandas as pd
import numpy as np

planets = pd.read_csv('data/planets.csv')
print(planets.shape)
planets.head()

(1035, 6)

            method  number  orbital_period   mass  distance  year
0  Radial Velocity       1         269.300   7.10     77.40  2006
1  Radial Velocity       1         874.774   2.21     56.95  2008
2  Radial Velocity       1         763.000   2.60     19.84  2011
3  Radial Velocity       1         326.030  19.40    110.62  2007
4  Radial Velocity       1         516.220  10.50    119.47  2009